# Taps
tap "oven-sh/bun"
tap "nikitabobko/tap"

# Formulaes
brew "fish" # Good shell
brew "fzf" # Fuzzy Finder
brew "fd" # Better find command
brew "bat" # Better cat command
brew "gh" # GitHub CLI
brew "starship" # Prompts
brew "oven-sh/bun/bun"
brew "mise"
brew "btop"
brew "neovim"
brew "ripgrep"
brew "flyctl" # Fly.io
brew "subfinder"
brew "ffmpeg"

# Casks
cask "ghostty" # Goated terminal emulator
cask "google-chrome" # i miss arc.
cask "raycast" # Great spotlight replacement
cask "zed" # Best IDE
cask "slack"
cask "discord"
cask "spotify"
cask "signal"
cask "nikitabobko/tap/aerospace"
cask "chatgpt"
cask "visual-studio-code"

# Fonts
cask "font-jetbrains-mono"
cask "font-fira-code-nerd-font"
